In [7]:
import pandas as pd
from io import StringIO
import json

In [12]:
import pandas as pd
import json

# Your JSON data as a string
data = '{"name": "John", "age": 30, "city": "New York"}'

# Convert JSON string to a dictionary
data_dict = json.loads(data)

# Convert dictionary to a DataFrame (you need to pass an index)
df = pd.DataFrame([data_dict])
print(df)

   name  age      city
0  John   30  New York

In [13]:
df.to_json()

'{"name":{"0":"John"},"age":{"0":30},"city":{"0":"New York"}}'

In [14]:
df.to_json(orient="index")

'{"0":{"name":"John","age":30,"city":"New York"}}'

In [15]:
df.to_json(orient="records")

'[{"name":"John","age":30,"city":"New York"}]'

In [ ]:
#df.pd.read_csv("httpjssdkjdksjdk/wine/wine.data",header=None)

In [19]:
df=pd.read_csv("wine.csv",header=None)

In [20]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,NaN,0,1.00,2.00,3.00,4.0,5,6.00,7.00,8.00,9.00,10.00,11.00,12.00,13
1,0.0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
2,1.0,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
3,2.0,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
4,3.0,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480

In [21]:
url="https://www.fdic.gov/bank-failures/failed-bank-list"
df=pd.read_html(url)

In [22]:
df

[                               Bank Name               City          State  \
 0  Republic First Bank dba Republic Bank       Philadelphia   Pennsylvania
 1                          Citizens Bank           Sac City           Iowa
 2               Heartland Tri-State Bank            Elkhart         Kansas
 3                    First Republic Bank      San Francisco     California
 4                         Signature Bank           New York       New York
 5                    Silicon Valley Bank        Santa Clara     California
 6                      Almena State Bank             Almena         Kansas
 7             First City Bank of Florida  Fort Walton Beach        Florida
 8                   The First State Bank      Barboursville  West Virginia
 9                     Ericson State Bank            Ericson       Nebraska

     Cert                 Aquiring Institution       Closing Date   Fund
 0  27332    Fulton Bank, National Association     April 26, 2024  10546
 1   8758            Iowa Trust & Savings Bank   November 3, 2023  10545
 2  25851               Dream First Bank, N.A.      July 28, 2023  10544
 3  59017            JPMorgan Chase Bank, N.A.        May 1, 2023  10543
 4  57053                  Flagstar Bank, N.A.     March 12, 2023  10540
 5  24735  First Citizens Bank & Trust Company     March 10, 2023  10539
 6  15426                          Equity Bank   October 23, 2020  10538
 7  16748            United Fidelity Bank, fsb   October 16, 2020  10537
 8  14361                       MVB Bank, Inc.      April 3, 2020  10536
 9  18265           Farmers and Merchants Bank  February 14, 2020  10535  ]

In [28]:
df=df[0]

In [29]:
df

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund
0,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
5,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
6,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
7,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
8,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
9,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535

In [30]:
df.head()

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund
0,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540

In [31]:
df.shape

(10, 7)

In [35]:
#we can also match the specific keyword to get specific table
!pip install html5lib
pd.read_html(url,match="Bank Name",header=0)[0]

Requirement already satisfied: html5lib in d:\anaconda3\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in d:\anaconda3\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in d:\anaconda3\lib\site-packages (from html5lib) (0.5.1)

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund
0,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
5,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
6,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
7,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
8,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
9,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535

In [37]:
df=pd.read_excel("data.xlsx")

In [38]:
df.head()

    Name  Age
0  Krish   32
1   Jack   34
2   John   31

In [39]:
df.shape

(3, 2)

In [40]:
df=df.to_pickle("df")

In [43]:
#this pickle file is completely serialized to read it 
pd.read_pickle("df")

    Name  Age
0  Krish   32
1   Jack   34
2   John   31